{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Working with Social-Network Graphs in NEO4J\n",
    "\n",
    "Before using this code you need to install a local instance of NEO4J and add the movie data set. You can download the community edition here: https://neo4j.com/. If you just want to explore the data, the movie data set is available in the sandbox environment available on that site.\n",
    "\n",
    "To add the movie data set:\n",
    "1. Enter :play movie-graph to the NEO4J command line and click Play\n",
    "2. Navigate to the second slide\n",
    "3. Click on the small Play icon next to the example code\n",
    "3. Click Play to run the batch create\n",
    "\n",
    "To view the entire network, use the query START n=node(*) MATCH (n)-[r]->(m) RETURN n,r,m"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "#!pip install bottle"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "#!pip install neo4j-driver"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": true,
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "#!pip install py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "from py2neo import Graph\n",
    "from bottle import get, run, request, response, static_file\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "graph = Graph(\"http://neo4j:password@127.0.0.1:7474\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The default password in NEO4J is 'neo4j'. You will be prompted to change it the first time you log in."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def get_graph(graph):\n",
    "    results = graph.run(\n",
    "        \"MATCH (m:Movie)<-[:ACTED_IN]-(a:Person) \"\n",
    "        \"RETURN m.title as movie, collect(a.name) as cast \")\n",
    "    nodes = []\n",
    "    rels = []\n",
    "    i = 0\n",
    "    for movie, cast in results:\n",
    "        nodes.append({\"title\": movie, \"label\": \"movie\"})\n",
    "        target = i\n",
    "        i += 1\n",
    "        for name in cast:\n",
    "            actor = {\"title\": name, \"label\": \"actor\"}\n",
    "            try:\n",
    "                source = nodes.index(actor)\n",
    "            except ValueError:\n",
    "                nodes.append(actor)\n",
    "                source = i\n",
    "                i += 1\n",
    "            rels.append({\"source\": source, \"target\": target})\n",
    "    return {\"nodes\": nodes, \"links\": rels}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'links': [{'source': 1, 'target': 0},\n",
       "  {'source': 2, 'target': 0},\n",
       "  {'source': 3, 'target': 0},\n",
       "  {'source': 4, 'target': 0},\n",
       "  {'source': 5, 'target': 0},\n",
       "  {'source': 1, 'target': 6},\n",
       "  {'source': 7, 'target': 6},\n",
       "  {'source': 8, 'target': 6},\n",
       "  {'source': 9, 'target': 6},\n",
       "  {'source': 10, 'target': 6},\n",
       "  {'source': 11, 'target': 6},\n",
       "  {'source': 13, 'target': 12},\n",
       "  {'source': 14, 'target': 12},\n",
       "  {'source': 15, 'target': 12},\n",
       "  {'source': 16, 'target': 12},\n",
       "  {'source': 18, 'target': 17},\n",
       "  {'source': 19, 'target': 17},\n",
       "  {'source': 20, 'target': 17},\n",
       "  {'source': 21, 'target': 17},\n",
       "  {'source': 22, 'target': 17},\n",
       "  {'source': 23, 'target': 17},\n",
       "  {'source': 24, 'target': 17},\n",
       "  {'source': 1, 'target': 25},\n",
       "  {'source': 27, 'target': 26},\n",
       "  {'source': 28, 'target': 26},\n",
       "  {'source': 29, 'target': 26},\n",
       "  {'source': 30, 'target': 26},\n",
       "  {'source': 32, 'target': 31},\n",
       "  {'source': 33, 'target': 31},\n",
       "  {'source': 14, 'target': 31},\n",
       "  {'source': 35, 'target': 34},\n",
       "  {'source': 36, 'target': 34},\n",
       "  {'source': 37, 'target': 34},\n",
       "  {'source': 7, 'target': 34},\n",
       "  {'source': 39, 'target': 38},\n",
       "  {'source': 7, 'target': 38},\n",
       "  {'source': 1, 'target': 38},\n",
       "  {'source': 14, 'target': 40},\n",
       "  {'source': 41, 'target': 40},\n",
       "  {'source': 42, 'target': 40},\n",
       "  {'source': 43, 'target': 40},\n",
       "  {'source': 1, 'target': 44},\n",
       "  {'source': 45, 'target': 44},\n",
       "  {'source': 46, 'target': 44},\n",
       "  {'source': 47, 'target': 44},\n",
       "  {'source': 39, 'target': 48},\n",
       "  {'source': 43, 'target': 48},\n",
       "  {'source': 49, 'target': 48},\n",
       "  {'source': 1, 'target': 50},\n",
       "  {'source': 7, 'target': 50},\n",
       "  {'source': 51, 'target': 50},\n",
       "  {'source': 52, 'target': 50},\n",
       "  {'source': 53, 'target': 50},\n",
       "  {'source': 54, 'target': 50},\n",
       "  {'source': 56, 'target': 55},\n",
       "  {'source': 11, 'target': 55},\n",
       "  {'source': 19, 'target': 55},\n",
       "  {'source': 57, 'target': 55},\n",
       "  {'source': 59, 'target': 58},\n",
       "  {'source': 60, 'target': 58},\n",
       "  {'source': 61, 'target': 58},\n",
       "  {'source': 62, 'target': 58},\n",
       "  {'source': 1, 'target': 58},\n",
       "  {'source': 63, 'target': 58},\n",
       "  {'source': 5, 'target': 58},\n",
       "  {'source': 64, 'target': 58},\n",
       "  {'source': 1, 'target': 65},\n",
       "  {'source': 54, 'target': 65},\n",
       "  {'source': 66, 'target': 65},\n",
       "  {'source': 67, 'target': 65},\n",
       "  {'source': 68, 'target': 65},\n",
       "  {'source': 4, 'target': 65},\n",
       "  {'source': 70, 'target': 69},\n",
       "  {'source': 71, 'target': 69},\n",
       "  {'source': 59, 'target': 69},\n",
       "  {'source': 72, 'target': 69},\n",
       "  {'source': 1, 'target': 73},\n",
       "  {'source': 32, 'target': 73},\n",
       "  {'source': 74, 'target': 73},\n",
       "  {'source': 76, 'target': 75},\n",
       "  {'source': 45, 'target': 75},\n",
       "  {'source': 77, 'target': 75},\n",
       "  {'source': 78, 'target': 75},\n",
       "  {'source': 79, 'target': 75},\n",
       "  {'source': 27, 'target': 80},\n",
       "  {'source': 8, 'target': 80},\n",
       "  {'source': 81, 'target': 80},\n",
       "  {'source': 82, 'target': 80},\n",
       "  {'source': 84, 'target': 83},\n",
       "  {'source': 27, 'target': 83},\n",
       "  {'source': 14, 'target': 83},\n",
       "  {'source': 86, 'target': 85},\n",
       "  {'source': 45, 'target': 85},\n",
       "  {'source': 87, 'target': 85},\n",
       "  {'source': 88, 'target': 85},\n",
       "  {'source': 14, 'target': 85},\n",
       "  {'source': 4, 'target': 89},\n",
       "  {'source': 81, 'target': 89},\n",
       "  {'source': 56, 'target': 89},\n",
       "  {'source': 90, 'target': 89},\n",
       "  {'source': 88, 'target': 91},\n",
       "  {'source': 14, 'target': 91},\n",
       "  {'source': 45, 'target': 91},\n",
       "  {'source': 87, 'target': 91},\n",
       "  {'source': 93, 'target': 92},\n",
       "  {'source': 90, 'target': 92},\n",
       "  {'source': 1, 'target': 92},\n",
       "  {'source': 95, 'target': 94},\n",
       "  {'source': 82, 'target': 94},\n",
       "  {'source': 96, 'target': 94},\n",
       "  {'source': 97, 'target': 94},\n",
       "  {'source': 98, 'target': 94},\n",
       "  {'source': 99, 'target': 94},\n",
       "  {'source': 60, 'target': 94},\n",
       "  {'source': 100, 'target': 94},\n",
       "  {'source': 23, 'target': 94},\n",
       "  {'source': 79, 'target': 101},\n",
       "  {'source': 102, 'target': 101},\n",
       "  {'source': 70, 'target': 101},\n",
       "  {'source': 103, 'target': 101},\n",
       "  {'source': 72, 'target': 104},\n",
       "  {'source': 105, 'target': 104},\n",
       "  {'source': 106, 'target': 104},\n",
       "  {'source': 82, 'target': 104},\n",
       "  {'source': 49, 'target': 104},\n",
       "  {'source': 45, 'target': 107},\n",
       "  {'source': 14, 'target': 107},\n",
       "  {'source': 87, 'target': 107},\n",
       "  {'source': 88, 'target': 107},\n",
       "  {'source': 109, 'target': 108},\n",
       "  {'source': 43, 'target': 108},\n",
       "  {'source': 110, 'target': 108},\n",
       "  {'source': 1, 'target': 111},\n",
       "  {'source': 112, 'target': 111},\n",
       "  {'source': 113, 'target': 111},\n",
       "  {'source': 114, 'target': 111},\n",
       "  {'source': 116, 'target': 115},\n",
       "  {'source': 117, 'target': 115},\n",
       "  {'source': 118, 'target': 115},\n",
       "  {'source': 119, 'target': 115},\n",
       "  {'source': 82, 'target': 115},\n",
       "  {'source': 120, 'target': 115},\n",
       "  {'source': 29, 'target': 115},\n",
       "  {'source': 27, 'target': 115},\n",
       "  {'source': 121, 'target': 115},\n",
       "  {'source': 2, 'target': 115},\n",
       "  {'source': 18, 'target': 115},\n",
       "  {'source': 96, 'target': 115},\n",
       "  {'source': 64, 'target': 122},\n",
       "  {'source': 123, 'target': 122},\n",
       "  {'source': 2, 'target': 122},\n",
       "  {'source': 124, 'target': 122},\n",
       "  {'source': 125, 'target': 122},\n",
       "  {'source': 123, 'target': 126},\n",
       "  {'source': 49, 'target': 126},\n",
       "  {'source': 27, 'target': 127},\n",
       "  {'source': 28, 'target': 127},\n",
       "  {'source': 81, 'target': 128},\n",
       "  {'source': 1, 'target': 128},\n",
       "  {'source': 7, 'target': 129},\n",
       "  {'source': 130, 'target': 129},\n",
       "  {'source': 131, 'target': 129},\n",
       "  {'source': 132, 'target': 129},\n",
       "  {'source': 133, 'target': 129},\n",
       "  {'source': 96, 'target': 129},\n",
       "  {'source': 103, 'target': 134},\n",
       "  {'source': 79, 'target': 134},\n",
       "  {'source': 135, 'target': 134},\n",
       "  {'source': 136, 'target': 134},\n",
       "  {'source': 137, 'target': 134},\n",
       "  {'source': 138, 'target': 134},\n",
       "  {'source': 139, 'target': 134}],\n",
       " 'nodes': [{'label': 'movie', 'title': 'Apollo 13'},\n",
       "  {'label': 'actor', 'title': 'Tom Hanks'},\n",
       "  {'label': 'actor', 'title': 'Kevin Bacon'},\n",
       "  {'label': 'actor', 'title': 'Ed Harris'},\n",
       "  {'label': 'actor', 'title': 'Bill Paxton'},\n",
       "  {'label': 'actor', 'title': 'Gary Sinise'},\n",
       "  {'label': 'movie', 'title': \"You've Got Mail\"},\n",
       "  {'label': 'actor', 'title': 'Meg Ryan'},\n",
       "  {'label': 'actor', 'title': 'Greg Kinnear'},\n",
       "  {'label': 'actor', 'title': 'Parker Posey'},\n",
       "  {'label': 'actor', 'title': 'Dave Chappelle'},\n",
       "  {'label': 'actor', 'title': 'Steve Zahn'},\n",
       "  {'label': 'movie', 'title': 'Johnny Mnemonic'},\n",
       "  {'label': 'actor', 'title': 'Ice-T'},\n",
       "  {'label': 'actor', 'title': 'Keanu Reeves'},\n",
       "  {'label': 'actor', 'title': 'Takeshi Kitano'},\n",
       "  {'label': 'actor', 'title': 'Dina Meyer'},\n",
       "  {'label': 'movie', 'title': 'Stand By Me'},\n",
       "  {'label': 'actor', 'title': 'Kiefer Sutherland'},\n",
       "  {'label': 'actor', 'title': 'Marshall Bell'},\n",
       "  {'label': 'actor', 'title': 'Corey Feldman'},\n",
       "  {'label': 'actor', 'title': 'John Cusack'},\n",
       "  {'label': 'actor', 'title': 'River Phoenix'},\n",
       "  {'label': 'actor', 'title': \"Jerry O'Connell\"},\n",
       "  {'label': 'actor', 'title': 'Wil Wheaton'},\n",
       "  {'label': 'movie', 'title': 'The Polar Express'},\n",
       "  {'label': 'movie', 'title': 'Hoffa'},\n",
       "  {'label': 'actor', 'title': 'Jack Nicholson'},\n",
       "  {'label': 'actor', 'title': 'Danny DeVito'},\n",
       "  {'label': 'actor', 'title': 'J.T. Walsh'},\n",
       "  {'label': 'actor', 'title': 'John C. Reilly'},\n",
       "  {'label': 'movie', 'title': \"The Devil's Advocate\"},\n",
       "  {'label': 'actor', 'title': 'Charlize Theron'},\n",
       "  {'label': 'actor', 'title': 'Al Pacino'},\n",
       "  {'label': 'movie', 'title': 'When Harry Met Sally'},\n",
       "  {'label': 'actor', 'title': 'Billy Crystal'},\n",
       "  {'label': 'actor', 'title': 'Bruno Kirby'},\n",
       "  {'label': 'actor', 'title': 'Carrie Fisher'},\n",
       "  {'label': 'movie', 'title': 'Joe Versus the Volcano'},\n",
       "  {'label': 'actor', 'title': 'Nathan Lane'},\n",
       "  {'label': 'movie', 'title': 'The Replacements'},\n",
       "  {'label': 'actor', 'title': 'Orlando Jones'},\n",
       "  {'label': 'actor', 'title': 'Brooke Langton'},\n",
       "  {'label': 'actor', 'title': 'Gene Hackman'},\n",
       "  {'label': 'movie', 'title': 'Cloud Atlas'},\n",
       "  {'label': 'actor', 'title': 'Hugo Weaving'},\n",
       "  {'label': 'actor', 'title': 'Halle Berry'},\n",
       "  {'label': 'actor', 'title': 'Jim Broadbent'},\n",
       "  {'label': 'movie', 'title': 'The Birdcage'},\n",
       "  {'label': 'actor', 'title': 'Robin Williams'},\n",
       "  {'label': 'movie', 'title': 'Sleepless in Seattle'},\n",
       "  {'label': 'actor', 'title': 'Rita Wilson'},\n",
       "  {'label': 'actor', 'title': 'Bill Pullman'},\n",
       "  {'label': 'actor', 'title': 'Victor Garber'},\n",
       "  {'label': 'actor', 'title': \"Rosie O'Donnell\"},\n",
       "  {'label': 'movie', 'title': 'RescueDawn'},\n",
       "  {'label': 'actor', 'title': 'Zach Grenier'},\n",
       "  {'label': 'actor', 'title': 'Christian Bale'},\n",
       "  {'label': 'movie', 'title': 'The Green Mile'},\n",
       "  {'label': 'actor', 'title': 'James Cromwell'},\n",
       "  {'label': 'actor', 'title': 'Bonnie Hunt'},\n",
       "  {'label': 'actor', 'title': 'David Morse'},\n",
       "  {'label': 'actor', 'title': 'Michael Clarke Duncan'},\n",
       "  {'label': 'actor', 'title': 'Patricia Clarkson'},\n",
       "  {'label': 'actor', 'title': 'Sam Rockwell'},\n",
       "  {'label': 'movie', 'title': 'A League of Their Own'},\n",
       "  {'label': 'actor', 'title': 'Madonna'},\n",
       "  {'label': 'actor', 'title': 'Geena Davis'},\n",
       "  {'label': 'actor', 'title': 'Lori Petty'},\n",
       "  {'label': 'movie', 'title': 'Snow Falling on Cedars'},\n",
       "  {'label': 'actor', 'title': 'Rick Yune'},\n",
       "  {'label': 'actor', 'title': 'Ethan Hawke'},\n",
       "  {'label': 'actor', 'title': 'Max von Sydow'},\n",
       "  {'label': 'movie', 'title': 'That Thing You Do'},\n",
       "  {'label': 'actor', 'title': 'Liv Tyler'},\n",
       "  {'label': 'movie', 'title': 'V for Vendetta'},\n",
       "  {'label': 'actor', 'title': 'Natalie Portman'},\n",
       "  {'label': 'actor', 'title': 'John Hurt'},\n",
       "  {'label': 'actor', 'title': 'Stephen Rea'},\n",
       "  {'label': 'actor', 'title': 'Ben Miles'},\n",
       "  {'label': 'movie', 'title': 'As Good as It Gets'},\n",
       "  {'label': 'actor', 'title': 'Helen Hunt'},\n",
       "  {'label': 'actor', 'title': 'Cuba Gooding Jr.'},\n",
       "  {'label': 'movie', 'title': \"Something's Gotta Give\"},\n",
       "  {'label': 'actor', 'title': 'Diane Keaton'},\n",
       "  {'label': 'movie', 'title': 'The Matrix'},\n",
       "  {'label': 'actor', 'title': 'Emil Eifrem'},\n",
       "  {'label': 'actor', 'title': 'Laurence Fishburne'},\n",
       "  {'label': 'actor', 'title': 'Carrie-Anne Moss'},\n",
       "  {'label': 'movie', 'title': 'Twister'},\n",
       "  {'label': 'actor', 'title': 'Philip Seymour Hoffman'},\n",
       "  {'label': 'movie', 'title': 'The Matrix Revolutions'},\n",
       "  {'label': 'movie', 'title': \"Charlie Wilson's War\"},\n",
       "  {'label': 'actor', 'title': 'Julia Roberts'},\n",
       "  {'label': 'movie', 'title': 'Jerry Maguire'},\n",
       "  {'label': 'actor', 'title': 'Renee Zellweger'},\n",
       "  {'label': 'actor', 'title': 'Tom Cruise'},\n",
       "  {'label': 'actor', 'title': 'Regina King'},\n",
       "  {'label': 'actor', 'title': 'Jonathan Lipnicki'},\n",
       "  {'label': 'actor', 'title': 'Jay Mohr'},\n",
       "  {'label': 'actor', 'title': 'Kelly Preston'},\n",
       "  {'label': 'movie', 'title': 'Ninja Assassin'},\n",
       "  {'label': 'actor', 'title': 'Naomie Harris'},\n",
       "  {'label': 'actor', 'title': 'Rain'},\n",
       "  {'label': 'movie', 'title': 'What Dreams May Come'},\n",
       "  {'label': 'actor', 'title': 'Annabella Sciorra'},\n",
       "  {'label': 'actor', 'title': 'Werner Herzog'},\n",
       "  {'label': 'movie', 'title': 'The Matrix Reloaded'},\n",
       "  {'label': 'movie', 'title': 'Unforgiven'},\n",
       "  {'label': 'actor', 'title': 'Clint Eastwood'},\n",
       "  {'label': 'actor', 'title': 'Richard Harris'},\n",
       "  {'label': 'movie', 'title': 'The Da Vinci Code'},\n",
       "  {'label': 'actor', 'title': 'Audrey Tautou'},\n",
       "  {'label': 'actor', 'title': 'Ian McKellen'},\n",
       "  {'label': 'actor', 'title': 'Paul Bettany'},\n",
       "  {'label': 'movie', 'title': 'A Few Good Men'},\n",
       "  {'label': 'actor', 'title': 'Aaron Sorkin'},\n",
       "  {'label': 'actor', 'title': 'Christopher Guest'},\n",
       "  {'label': 'actor', 'title': 'James Marshall'},\n",
       "  {'label': 'actor', 'title': 'Noah Wyle'},\n",
       "  {'label': 'actor', 'title': 'Kevin Pollak'},\n",
       "  {'label': 'actor', 'title': 'Demi Moore'},\n",
       "  {'label': 'movie', 'title': 'Frost/Nixon'},\n",
       "  {'label': 'actor', 'title': 'Oliver Platt'},\n",
       "  {'label': 'actor', 'title': 'Michael Sheen'},\n",
       "  {'label': 'actor', 'title': 'Frank Langella'},\n",
       "  {'label': 'movie', 'title': 'Bicentennial Man'},\n",
       "  {'label': 'movie', 'title': \"One Flew Over the Cuckoo's Nest\"},\n",
       "  {'label': 'movie', 'title': 'Cast Away'},\n",
       "  {'label': 'movie', 'title': 'Top Gun'},\n",
       "  {'label': 'actor', 'title': 'Tom Skerritt'},\n",
       "  {'label': 'actor', 'title': 'Anthony Edwards'},\n",
       "  {'label': 'actor', 'title': 'Val Kilmer'},\n",
       "  {'label': 'actor', 'title': 'Kelly McGillis'},\n",
       "  {'label': 'movie', 'title': 'Speed Racer'},\n",
       "  {'label': 'actor', 'title': 'Matthew Fox'},\n",
       "  {'label': 'actor', 'title': 'Christina Ricci'},\n",
       "  {'label': 'actor', 'title': 'John Goodman'},\n",
       "  {'label': 'actor', 'title': 'Susan Sarandon'},\n",
       "  {'label': 'actor', 'title': 'Emile Hirsch'}]}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_graph(graph)\n",
    "# Output format is a Cursor"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In your NEO4J environment, run the query:\n",
    "\n",
    "MATCH (bacon:Person {name:\"Kevin Bacon\"})-[*1..3]-(hollywood)\n",
    "RETURN DISTINCT hollywood\n",
    "\n",
    "This returns 3 \"degrees of Kevin Bacon\". The same code using py2neo is:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "bacon = graph.run(\n",
    "    \"MATCH (bacon:Person {name:'Kevin Bacon'})-[*1..3]-(hollywood)\"\n",
    "    \"RETURN DISTINCT hollywood\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'hollywood': (b1ade89:Person {born:1938,name:\"Frank Langella\"})}, {'hollywood': (d719dc5:Person {born:1951,name:\"Robin Williams\"})}, {'hollywood': (ee8c940:Person {born:1958,name:\"Chris Columbus\"})}, {'hollywood': (d363f5e:Movie {released:1999,tagline:\"One robot's 200 year journey to become an ordinary man.\",title:\"Bicentennial Man\"})}, {'hollywood': (f22e933:Person {born:1960,name:\"Oliver Platt\"})}, {'hollywood': (b223160:Person {born:1959,name:\"Frank Darabont\"})}, {'hollywood': (ad042e5:Person {born:1955,name:\"Gary Sinise\"})}, {'hollywood': (cf79cd0:Person {born:1959,name:\"Patricia Clarkson\"})}, {'hollywood': (d14a06e:Person {born:1961,name:\"Bonnie Hunt\"})}, {'hollywood': (e3136b0:Person {born:1953,name:\"David Morse\"})}, {'hollywood': (cd60567:Person {born:1940,name:\"James Cromwell\"})}, {'hollywood': (d62d281:Person {born:1957,name:\"Michael Clarke Duncan\"})}, {'hollywood': (d58bfca:Person {born:1956,name:\"Tom Hanks\"})}, {'hollywood': (fd4ad04:Movie {released:1999,tagline:\"Walk a mile you'll never forget.\",title:\"The Green Mile\"})}, {'hollywood': (f8ff223:Person {born:1968,name:\"Sam Rockwell\"})}, {'hollywood': (dd566ef:Person {born:1969,name:\"Michael Sheen\"})}, {'hollywood': (d9c7dc0:Person {born:1955,name:\"Bill Paxton\"})}, {'hollywood': (f4552a7:Person {born:1950,name:\"Ed Harris\"})}, {'hollywood': (ab1b9dc:Person {born:1958,name:\"Kevin Bacon\"})}, {'hollywood': (e4843aa:Movie {released:1995,tagline:\"Houston, we have a problem.\",title:\"Apollo 13\"})}, {'hollywood': (f73f425:Person {name:\"James Thompson\"})}, {'hollywood': (a0967ea:Person {name:\"Jessica Thompson\"})}, {'hollywood': (c4f910e:Person {born:1939,name:\"Ian McKellen\"})}, {'hollywood': (cde22ad:Person {born:1971,name:\"Paul Bettany\"})}, {'hollywood': (fc68796:Person {born:1976,name:\"Audrey Tautou\"})}, {'hollywood': (bba1256:Movie {released:2006,tagline:\"Break The Codes\",title:\"The Da Vinci Code\"})}, {'hollywood': (dad887a:Person {born:1954,name:\"Ron Howard\"})}, {'hollywood': (ed252fd:Movie {released:2008,tagline:\"400 million people were waiting for the truth.\",title:\"Frost/Nixon\"})}, {'hollywood': (ae76ebb:Person {born:1962,name:\"Rosie O'Donnell\"})}, {'hollywood': (d60ed95:Person {born:1963,name:\"Lori Petty\"})}, {'hollywood': (eafbbca:Person {born:1954,name:\"Madonna\"})}, {'hollywood': (cdbba2d:Person {born:1943,name:\"Penny Marshall\"})}, {'hollywood': (fce2049:Person {born:1956,name:\"Geena Davis\"})}, {'hollywood': (dd6da71:Movie {released:1992,tagline:\"Once in a lifetime you get a chance to do something different.\",title:\"A League of Their Own\"})}, {'hollywood': (a5a8f5d:Person {born:1967,name:\"Philip Seymour Hoffman\"})}, {'hollywood': (d7c30c8:Person {born:1954,name:\"Zach Grenier\"})}, {'hollywood': (a1bdea9:Person {born:1963,name:\"Helen Hunt\"})}, {'hollywood': (cce9a0c:Person {born:1943,name:\"Jan de Bont\"})}, {'hollywood': (f6abf26:Movie {released:1996,tagline:\"Don't Breathe. Don't Look Back.\",title:\"Twister\"})}, {'hollywood': (d85ac52:Person {born:1967,name:\"Julia Roberts\"})}, {'hollywood': (a0a2fbb:Person {born:1931,name:\"Mike Nichols\"})}, {'hollywood': (c097b9e:Movie {released:2007,tagline:\"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\",title:\"Charlie Wilson's War\"})}, {'hollywood': (c978b94:Person {born:1951,name:\"Robert Zemeckis\"})}, {'hollywood': (ae84a91:Movie {released:2004,tagline:\"This Holiday Season… Believe\",title:\"The Polar Express\"})}, {'hollywood': (c2992b6:Movie {released:2000,tagline:\"At the edge of the world, his journey begins.\",title:\"Cast Away\"})}, {'hollywood': (a7f6616:Person {born:1961,name:\"Stefan Arndt\"})}, {'hollywood': (e871156:Person {born:1969,name:\"David Mitchell\"})}, {'hollywood': (f5a3cd6:Person {born:1965,name:\"Lana Wachowski\"})}, {'hollywood': (a4444db:Person {born:1967,name:\"Lilly Wachowski\"})}, {'hollywood': (c4e8464:Person {born:1965,name:\"Tom Tykwer\"})}, {'hollywood': (fabd228:Person {born:1949,name:\"Jim Broadbent\"})}, {'hollywood': (f40dc88:Person {born:1960,name:\"Hugo Weaving\"})}, {'hollywood': (b80b1c7:Person {born:1966,name:\"Halle Berry\"})}, {'hollywood': (c685154:Movie {released:2012,tagline:\"Everything is connected\",title:\"Cloud Atlas\"})}, {'hollywood': (d03c416:Person {born:1977,name:\"Liv Tyler\"})}, {'hollywood': (fa8f526:Person {born:1975,name:\"Charlize Theron\"})}, {'hollywood': (ac2c8a5:Movie {released:1996,tagline:\"In every life there comes a time when that thing you dream becomes that thing you do\",title:\"That Thing You Do\"})}, {'hollywood': (d1170e4:Person {born:1950,name:\"John Patrick Stanley\"})}, {'hollywood': (a5b86c1:Person {born:1956,name:\"Nathan Lane\"})}, {'hollywood': (f4fc629:Person {born:1961,name:\"Meg Ryan\"})}, {'hollywood': (e3d8963:Movie {released:1990,tagline:\"A story of love, lava and burning desire.\",title:\"Joe Versus the Volcano\"})}, {'hollywood': (cf7936d:Person {born:1963,name:\"Greg Kinnear\"})}, {'hollywood': (c218bc7:Person {born:1968,name:\"Parker Posey\"})}, {'hollywood': (af9daab:Person {born:1941,name:\"Nora Ephron\"})}, {'hollywood': (fc0de1a:Person {born:1973,name:\"Dave Chappelle\"})}, {'hollywood': (ab54831:Person {born:1967,name:\"Steve Zahn\"})}, {'hollywood': (b1b9dc8:Movie {released:1998,tagline:\"At odds in life... in love on-line.\",title:\"You've Got Mail\"})}, {'hollywood': (a96ff21:Person {born:1956,name:\"Rita Wilson\"})}, {'hollywood': (bc75fe6:Person {born:1949,name:\"Victor Garber\"})}, {'hollywood': (c0053a7:Person {born:1953,name:\"Bill Pullman\"})}, {'hollywood': (acb779b:Movie {released:1993,tagline:\"What if someone you never met, someone you never saw, someone you never knew was the only someone for you?\",title:\"Sleepless in Seattle\"})}, {'hollywood': (c1b1c04:Person {born:1948,name:\"Christopher Guest\"})}, {'hollywood': (a3d15d2:Person {born:1947,name:\"Rob Reiner\"})}, {'hollywood': (d8f6827:Person {born:1957,name:\"Kevin Pollak\"})}, {'hollywood': (cec7996:Person {born:1968,name:\"Cuba Gooding Jr.\"})}, {'hollywood': (f16ded5:Person {born:1967,name:\"James Marshall\"})}, {'hollywood': (a6edfb2:Person {born:1943,name:\"J.T. Walsh\"})}, {'hollywood': (b3db24b:Person {born:1962,name:\"Demi Moore\"})}, {'hollywood': (f23c704:Person {born:1971,name:\"Noah Wyle\"})}, {'hollywood': (a485083:Person {born:1966,name:\"Kiefer Sutherland\"})}, {'hollywood': (d270577:Person {born:1962,name:\"Tom Cruise\"})}, {'hollywood': (d768b7d:Person {born:1937,name:\"Jack Nicholson\"})}, {'hollywood': (d62e87f:Movie {released:1992,tagline:\"In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.\",title:\"A Few Good Men\"})}, {'hollywood': (f31386e:Person {born:1961,name:\"Aaron Sorkin\"})}, {'hollywood': (f5643f5:Person {born:1948,name:\"Billy Crystal\"})}, {'hollywood': (dbed6fd:Person {born:1949,name:\"Bruno Kirby\"})}, {'hollywood': (b7ddf90:Person {born:1956,name:\"Carrie Fisher\"})}, {'hollywood': (c18a9d5:Movie {released:1998,tagline:\"At odds in life... in love on-line.\",title:\"When Harry Met Sally\"})}, {'hollywood': (fc396ed:Person {born:1971,name:\"Corey Feldman\"})}, {'hollywood': (c025ace:Person {born:1974,name:\"Jerry O'Connell\"})}, {'hollywood': (cd8e39f:Person {born:1970,name:\"River Phoenix\"})}, {'hollywood': (a4567fb:Person {born:1972,name:\"Wil Wheaton\"})}, {'hollywood': (ef2b4f5:Person {born:1942,name:\"Marshall Bell\"})}, {'hollywood': (c137bcf:Person {born:1966,name:\"John Cusack\"})}, {'hollywood': (e9e812b:Movie {released:1986,tagline:\"For some, it's the last real taste of innocence, and the first real taste of life. But for everyone, it's the time that memories are made of.\",title:\"Stand By Me\"})}, {'hollywood': (bba4434:Person {born:1940,name:\"James L. Brooks\"})}, {'hollywood': (b4721e3:Movie {released:1997,tagline:\"A comedy from the heart that goes for the throat.\",title:\"As Good as It Gets\"})}, {'hollywood': (f700d40:Person {born:1956,name:\"Vincent Ward\"})}, {'hollywood': (c34ee1e:Person {born:1929,name:\"Max von Sydow\"})}, {'hollywood': (cd401f0:Person {born:1942,name:\"Werner Herzog\"})}, {'hollywood': (dd017e4:Person {born:1960,name:\"Annabella Sciorra\"})}, {'hollywood': (f52eaf8:Movie {released:1998,tagline:\"After life there is more. The end is just the beginning.\",title:\"What Dreams May Come\"})}, {'hollywood': (d910146:Person {born:1996,name:\"Jonathan Lipnicki\"})}, {'hollywood': (f2ff24c:Person {born:1957,name:\"Cameron Crowe\"})}, {'hollywood': (d7415ed:Person {born:1970,name:\"Jay Mohr\"})}, {'hollywood': (b3f565a:Person {born:1971,name:\"Regina King\"})}, {'hollywood': (b3a8f8b:Person {born:1969,name:\"Renee Zellweger\"})}, {'hollywood': (e7e40c5:Person {born:1962,name:\"Kelly Preston\"})}, {'hollywood': (dc1b071:Movie {released:2000,tagline:\"The rest of his life begins now.\",title:\"Jerry Maguire\"})}, {'hollywood': (deeb5f5:Person {born:1967,name:\"Ben Miles\"})}, {'hollywood': (c729e1c:Person {born:1971,name:\"Rick Yune\"})}, {'hollywood': (f167442:Person {name:\"Naomie Harris\"})}, {'hollywood': (c3d73c3:Person {born:1982,name:\"Rain\"})}, {'hollywood': (ec3d809:Person {born:1952,name:\"Joel Silver\"})}, {'hollywood': (d54bc08:Movie {released:2009,tagline:\"Prepare to enter a secret world of assassins\",title:\"Ninja Assassin\"})}, {'hollywood': (de4335d:Person {born:1940,name:\"John Hurt\"})}, {'hollywood': (bfd61ba:Person {born:1946,name:\"Stephen Rea\"})}, {'hollywood': (d33aba1:Person {born:1981,name:\"Natalie Portman\"})}, {'hollywood': (e4f8f7c:Movie {released:2006,tagline:\"Freedom! Forever!\",title:\"V for Vendetta\"})}, {'hollywood': (db6e625:Person {born:1944,name:\"Danny DeVito\"})}, {'hollywood': (a54ecf6:Person {born:1965,name:\"John C. Reilly\"})}, {'hollywood': (e4e839d:Movie {released:1992,tagline:\"He didn't want law. He wanted justice.\",title:\"Hoffa\"})}, {'hollywood': (f537b9e:Person {born:1933,name:\"Tom Skerritt\"})}, {'hollywood': (f4c053b:Person {born:1944,name:\"Tony Scott\"})}, {'hollywood': (d1095e1:Person {born:1941,name:\"Jim Cash\"})}, {'hollywood': (a6bac2b:Person {born:1957,name:\"Kelly McGillis\"})}, {'hollywood': (a553e79:Person {born:1962,name:\"Anthony Edwards\"})}, {'hollywood': (b9ddd7b:Person {born:1959,name:\"Val Kilmer\"})}, {'hollywood': (d3e3639:Movie {released:1986,tagline:\"I feel the need, the need for speed.\",title:\"Top Gun\"})}, {'hollywood': (b14bd81:Person {born:1946,name:\"Diane Keaton\"})}, {'hollywood': (f38da2f:Person {born:1964,name:\"Keanu Reeves\"})}, {'hollywood': (bf5647c:Person {born:1949,name:\"Nancy Meyers\"})}, {'hollywood': (b5cef5f:Movie {released:2003,title:\"Something's Gotta Give\"})}, {'hollywood': (ef6928e:Person {born:1932,name:\"Milos Forman\"})}, {'hollywood': (f585065:Movie {released:1975,tagline:\"If he's crazy, what does that make you?\",title:\"One Flew Over the Cuckoo's Nest\"})}]\n"
     ]
    }
   ],
   "source": [
    "print(bacon.data())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "To create new nodes and relationships, you can similarly use graph.run()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x111602978>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\n",
    "    \"CREATE (spacey:Person {name:'Kevin Spacey', born: 1959})\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "In NEO4J: \n",
    "\n",
    "MATCH (p:Person) WHERE p.name=\"Kevin Spacey\" RETURN p \n",
    "\n",
    "shows the new \"Kevin Spacey\" node \n",
    "\n",
    "MATCH (p:Person {name:\"Kevin Spacey\"})-[*1..3]-(hollywood) RETURN DISTINCT p,hollywood \n",
    "\n",
    "shows that Kevin Spacey doesn't have any relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
